#데이터 저장을 위한 클래스
#기능 클래스 -> 기능 모듈
#데이터를 저장하고 있는 배열(리스트) -> []
#기능 메서드: 입력(리스트), 삭제(리스트 삭제), 검색, 전체 출력

#친구의 정보를 저장하는 리스트
pBooks = [] #이 파일안에서는 전역변수


def insertMember():
    name = input('이름을 입력해주세요.>>')
    pNum = input('전화번호를 입력해주세요.>>')
    bDay = input('생일을 입력해주세요.>>')

    member = {
        'name': name,
        'phoneNumber': pNum,
        'birthday': bDay
    }
    pBooks.append(member)
    print('정보입력이 완료되었습니다.')
    print('------------------------------------------------------------------------')
    print()

def showList():
    for member in pBooks:
        print()
        print('------------------------------------------------------------------------')
        print('전체 조회 목록')
        print(member)
        print('------------------------------------------------------------------------')
        print()


def selectMember():
    inputName = input('조회할 이름을 입력해주세요.>>')
    cnt=0
    for member in pBooks:
        if(member['name'] == inputName):
            print()
            print('------------------------------------------------------------------------')
            print('조회 목록')
            print('------------------------------------------------------------------------')
            print(member)
            print('------------------------------------------------------------------------')
            print()
            cnt = 1
            break
    if(cnt == 0):
        print()
        print('------------------------------------------------------------------------')
        print('해당하는 이름이 없습니다. 다시 입력해주세요.')
        print('------------------------------------------------------------------------')
        print()


def deleteMember ():
    inputName = input('삭제할 이름을 입력해주세요.>>')
    cnt=0
    for member in pBooks:
        if(member['name'] == inputName):
            pBooks.remove(member)
            print()
            print('------------------------------------------------------------------------')
            print('삭제되었습니다.')
            print('------------------------------------------------------------------------')
            print()
            cnt = 1
            break
    if(cnt == 0):
        print()
        print('------------------------------------------------------------------------')
        print('해당하는 이름이 없습니다. 다시 입력해주세요.')
        print('------------------------------------------------------------------------')
        print()

